{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.17.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_1", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_2"}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Custom>ModelEmbedding", "config": {"vocab_size": 20000, "emb_dim": 64, "maxlen": 128}, "name": "model_embedding_1", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Custom>TransformerBlock", "config": {"emb_dim": 64, "num_heads": 2, "ff_dim": 64, "rate": 0.1}, "name": "transformer_block_1", "inbound_nodes": [[["model_embedding_1", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_1", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "global_average_pooling1d_1", "inbound_nodes": [[["transformer_block_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_2", "inbound_nodes": [[["global_average_pooling1d_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "name": "dropout_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["dense_3", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": true, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "dense_2/kernel", "shape": [64, 128], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [128, 1], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [1], "dtype": "float32"}, {"name": "model_embedding_1/embedding_2/embeddings", "shape": [20000, 64], "dtype": "float32"}, {"name": "model_embedding_1/embedding_3/embeddings", "shape": [128, 64], "dtype": "float32"}, {"name": "transformer_block_1/multi_head_attention/query/kernel", "shape": [64, 64, 64], "dtype": "float32"}, {"name": "transformer_block_1/multi_head_attention/query/bias", "shape": [64, 64], "dtype": "float32"}, {"name": "transformer_block_1/multi_head_attention/key/kernel", "shape": [64, 64, 64], "dtype": "float32"}, {"name": "transformer_block_1/multi_head_attention/key/bias", "shape": [64, 64], "dtype": "float32"}, {"name": "transformer_block_1/multi_head_attention/value/kernel", "shape": [64, 64, 64], "dtype": "float32"}, {"name": "transformer_block_1/multi_head_attention/value/bias", "shape": [64, 64], "dtype": "float32"}, {"name": "transformer_block_1/multi_head_attention/attention_output/kernel", "shape": [64, 64, 64], "dtype": "float32"}, {"name": "transformer_block_1/multi_head_attention/attention_output/bias", "shape": [64], "dtype": "float32"}, {"name": "dense/kernel", "shape": [64, 64], "dtype": "float32"}, {"name": "dense/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [64, 64], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [64], "dtype": "float32"}, {"name": "transformer_block_1/layer_normalization/gamma", "shape": [64], "dtype": "float32"}, {"name": "transformer_block_1/layer_normalization/beta", "shape": [64], "dtype": "float32"}, {"name": "transformer_block_1/layer_normalization_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "transformer_block_1/layer_normalization_1/beta", "shape": [64], "dtype": "float32"}]}]}